[{"_path":"/posts/e-handel-i-norden-for-amazon","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"E-handel i Norden før Amazon","description":"Vi lever nå i de siste månedene før giganten Amazon endelig kommer til Norden. Vårt verdenshjørne gjenstår som et av de siste markedene uten en eller flere kjempeplattformer for netthandel, og det er der Amazon ser muligheten.","date":"2020-10-16T04:45:49.000Z","tags":["amazon","netthandel","plattform","aggregation"],"lang":"norwegian","_type":"markdown","_id":"content:posts:e-handel-i-norden-for-amazon:index.md","_source":"content","_file":"posts/e-handel-i-norden-for-amazon/index.md","_extension":"md","sitemap":{"loc":"/posts/e-handel-i-norden-for-amazon","images":[]}},{"_path":"/posts/getting-started-with-cd","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"Getting Started With CD","description":"Working with devops things like setting up custom CI/CD for my projects honestly scares the shit out of me. Once I start reading about how to do it, I realize how much I don't know. It's also so much harder to tinker with than just code, where you get instant feedback, and can debug. Tinkering with cloudformations, docker images, or virtual machines requires building and running them. Takes much longer time. There's also the sense of never being good enough. You start with a simple manual deployment method on Firebase or Heroku. Maybe you can use a hosted database on something like mLab. You can even make Heroku listen to your repo on Github. Works well, but it gets expensive if you want to scale. So I turn to using Docker and a virtual machine on Digital Ocean. I quickly realize just Docker is not enough. I need Docker Compose which complicates things a little bit. I also need to handle images, tags, expose, networks, etc. which I arrogantly think I can handle without taking the time to really learn what the are. I realize I need a place to host docker images, as Docker Hub only gives you one free private image. So I start making my own image repository on a virtual server. It needs to be served over HTTPS, so I also need to host an Nginx reverse proxy with Letsencrypt. I would be so lost here if there weren't for some great guides on how to do this. After some messing around with different Docker Compose versions I figure it out. I also learnt how easy it can be to get a certified HTTPS using these tools.","date":"2018-10-13T02:15:11.000Z","language":"english","type":"post","_type":"markdown","_id":"content:posts:getting-started-with-cd.md","_source":"content","_file":"posts/getting-started-with-cd.md","_extension":"md","sitemap":{"loc":"/posts/getting-started-with-cd","images":[]}}]