{"_path":"/posts/using-your-own-data-for-value","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"Using Your Own Data for Value","description":"","date":"2018-10-19T04:27:20.000Z","language":"english","type":"post","body":{"type":"root","children":[{"type":"element","tag":"h3","props":{"id":"get-value-from-your-own-data-with-gdpr-data-portability-requirements"},"children":[{"type":"text","value":"Get value from your own data with GDPR data portability requirements"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://gdpr-info.eu/art-20-gdpr/","rel":["nofollow"]},"children":[{"type":"text","value":"Article 20"}]},{"type":"text","value":" of the General Data Protection Regulation (GDPR) states that:"}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The data subject shall have the right to receive the personal data\nconcerning him or her, which he or she has provided to a controller,\nin a structured, commonly used and machine-readable format and have\nthe right to transmit those data to another controller "},{"type":"element","tag":"span","props":{},"children":[{"type":"text","value":"..."}]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This may seem like just one item in a long list of boring and complicated requirements in GDPR, but the implications can be quite drastic. It basically means that all the data any organization has stored about you, you have the right to receive in a machine readable format that you can either process yourself or give to a competitor. For social media it means all your likes, friend list, posts, pictures, etc. For your bank or payment processor it means all your transactions. For a loyalty program it means all your purchases. Data that is valueable to the companies that store them, and that they would never give away if not for regulations."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fine, but what does this mean for me? If you have ever been frustrated that your data has been locked into one platform, or one app, without being able to get it out, this is a solution. It will now be much easier to switch between apps and services. There are also opportunities for using the data yourself. If you can download all your payment transactions and receipts, you can feed them into a personal finance tool that can give you a detailed view of how you spend your money. It can also suggest how you can change your habits to save money by automatically doing price comparison. It's also not too far fetched that you can sell that data yourself to a company that does consumer analysis."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"All the talk around GDPR so far has been about companies comlying, and whether it is a good regulation or not. No matter the answer, it is here to stay, and we should use it for the good it's worth. I hope coders and data scientists take some time to experiment. See what data you can download from whatever services you use. I already mentioned banks and retailers as interesting data sources, but there is much more out there. What will your phone company give you? Make notes of what data you get and in which format, and make do some calculations, measure statistics, create visualizations, and share it (just erase your ... "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"sensitive"}]},{"type":"text","value":" information first)."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"get-value-from-your-own-data-with-gdpr-data-portability-requirements","depth":3,"text":"Get value from your own data with GDPR data portability requirements"}]}},"_type":"markdown","_id":"content:posts:using-your-own-data-for-value.md","_source":"content","_file":"posts/using-your-own-data-for-value.md","_extension":"md","sitemap":{"loc":"/posts/using-your-own-data-for-value","images":[]}}