[{"_path":"/posts/gdpr-kvitteringer","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"GDPR og dine kvitteringer","description":"EU sitt direktiv om personvern på nett har nå trådt i kraft og er blitt en del av norsk lov under personopplysningsloven. Som del av dette skal alle som har data lagret om seg ha rett til innsyn i deres data, og kanskje viktigere, ha “... rett til å motta personopplysninger ...  i et strukturert, alminnelig anvendt og maskinlesbart format ...”. Videre hintes det til at slik data skal kunne overføres automatisk fra en tilbyder til en annen “... ha rett til å få overført personopplysningene direkte fra en behandlingsansvarlig til en annen.” [Artikkel 20] Dette med data i maskinlesbart format betyr at en app skal kunne lese og bruke dataene, slik at man skal kunne bytte tilbyder, eller la en annen tilbyder bruke din data, på en enkel måte. Et fint ord som brukes til å beskrive dette er dataportabilitet. For eksempel skal det da være mulig å automatisk sende hele Facebook-profilen din til Google+, eller overføre alle preferansene dine fra hotels.com til booking.com.","date":"2018-09-14T13:41:53.000Z","language":"norwegian","draft":false,"_type":"markdown","_id":"content:posts:gdpr-kvitteringer:index.md","_source":"content","_file":"posts/gdpr-kvitteringer/index.md","_extension":"md","sitemap":{"loc":"/posts/gdpr-kvitteringer","images":[{"loc":"/posts/gdpr-kvitteringer/rema-ae-give-innsyn-data.png"},{"loc":"/posts/gdpr-kvitteringer/rema-ae-send-data-email.png"}]}},{"_path":"/posts/google-ai-product-search-vs-vertex-multimodal-embedding","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"Google Product Search vs Vertex AI multimodal embeddings","description":"Google offers a managed service for searching with images to find similar products called Product Search. It's a quite neat service that allows you to do product search without manually embedding images, setting up a vector database, manipulating images etc. The pricing is quite predictable with 1 USD per 10000 images stored and 4.50 USD per 1000 queries using images.\nThe service has not been updated much by Google, and it has no graphical interface in the Cloud Console, which makes it a bit hard to use. This, together with the first generation of Google Cloud AI services, seem to be neglected in favor of the new Vertex AI.","date":"2023-11-13T00:00:00.000Z","language":"english","draft":false,"layout":"article","_type":"markdown","_id":"content:posts:google-ai-product-search-vs-vertex-multimodal-embedding:index.md","_source":"content","_file":"posts/google-ai-product-search-vs-vertex-multimodal-embedding/index.md","_extension":"md","sitemap":{"loc":"/posts/google-ai-product-search-vs-vertex-multimodal-embedding","images":[]}}]