{"_path":"/posts/ai-to-the-masses-with-google-apis","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"AI to the masses with Google APIs","description":"","date":"2019-05-31T17:45:49.000Z","tags":["AI"," ML"," Google"," SaaS"," business idea"],"lang":"english","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I'm talking about Google's machine learning APIs available through Google Cloud. Google is no doubt one of, if not "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"the"}]},{"type":"text","value":", company with the most advanced AI in the world. Their competitors envy Google's ginourmous amounts of data, world class talent, and a culture for technical excellence. Wouldn't it be great if anybody could leverage their machine learning to create products in all sectors in all markets? Well, for a small price, services such as image and speech recognition are now available to all of us."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"We don't know exactly how useful the machine learning APIs are, but we can compare it to Amazon's launch of cloud computing. Amazon AWS made it cheap to deploy any application to the web, and the pay-as-you-go model allows startups to delay large payments as their revenue increases, instead of paying large fees upfront. This changed the economics for startups and enabled huge amounts of innovation, and eased access for companies without funding."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Similarly, deploying useful machine learning can be difficult and requires sought after expertise. Common tasks like image recognition now doesn't even require training, data, or data scientists. Anyone familiar with programming and cloud computing can now deploy services that use world class AI."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"NRKBeta recently published an article describing how the Norwegian state broadcaster experiments with speech recognition for transcription. I'm sure there are tons of services using speech or image recognition out there. Do you know of any worth mentioning?"}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:posts:ai-to-the-masses-with-google-apis.md","_source":"content","_file":"posts/ai-to-the-masses-with-google-apis.md","_extension":"md","sitemap":{"loc":"/posts/ai-to-the-masses-with-google-apis","images":[]}}