[{"_path":"/posts/conversation-with-yourself-on-messenger","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"Start a Conversation With Yourself on Messenger","description":"Did you know it's possible to have a conversation with yourself on Facebook Messenger? I discovered it by accident when creating a share button for my grocery price comparison site https://allematpriser.no. It's convenient to have a convo with yourself as it makes it possible to easily share text and files between your devices.","date":"2019-07-28T02:15:11.000Z","draft":false,"layout":"post","_type":"markdown","_id":"content:posts:conversation-with-yourself-on-messenger:index.md","_source":"content","_file":"posts/conversation-with-yourself-on-messenger/index.md","_extension":"md","sitemap":{"loc":"/posts/conversation-with-yourself-on-messenger","images":[]}},{"_path":"/posts/gdpr-kvitteringer","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"GDPR og dine kvitteringer","description":"EU sitt direktiv om personvern på nett har nå trådt i kraft og er blitt en del av norsk lov under personopplysningsloven. Som del av dette skal alle som har data lagret om seg ha rett til innsyn i deres data, og kanskje viktigere, ha “... rett til å motta personopplysninger ...  i et strukturert, alminnelig anvendt og maskinlesbart format ...”. Videre hintes det til at slik data skal kunne overføres automatisk fra en tilbyder til en annen “... ha rett til å få overført personopplysningene direkte fra en behandlingsansvarlig til en annen.” [Artikkel 20] Dette med data i maskinlesbart format betyr at en app skal kunne lese og bruke dataene, slik at man skal kunne bytte tilbyder, eller la en annen tilbyder bruke din data, på en enkel måte. Et fint ord som brukes til å beskrive dette er dataportabilitet. For eksempel skal det da være mulig å automatisk sende hele Facebook-profilen din til Google+, eller overføre alle preferansene dine fra hotels.com til booking.com.","date":"2018-09-14T13:41:53.000Z","language":"norwegian","draft":false,"_type":"markdown","_id":"content:posts:gdpr-kvitteringer:index.md","_source":"content","_file":"posts/gdpr-kvitteringer/index.md","_extension":"md","sitemap":{"loc":"/posts/gdpr-kvitteringer","images":[{"loc":"/posts/gdpr-kvitteringer/rema-ae-give-innsyn-data.png"},{"loc":"/posts/gdpr-kvitteringer/rema-ae-send-data-email.png"}]}}]