{"_path":"/posts/e-handel-i-norden-for-amazon","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"E-handel i Norden før Amazon","description":"Vi lever nå i de siste månedene før giganten Amazon endelig kommer til Norden. Vårt verdenshjørne gjenstår som et av de siste markedene uten en eller flere kjempeplattformer for netthandel, og det er der Amazon ser muligheten.","date":"2020-10-16T04:45:49.000Z","tags":["amazon","netthandel","plattform","aggregation"],"lang":"norwegian","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Et fraktfly fra Amazon med Prime-logoen på siden. I forgrunnen pakker fra Amazon klare til levering.","src":"/posts/e-handel-i-norden-for-amazon/amazon-prime-plane.jpg","style":{"aspectRatio":"2048/1367"}},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vi lever nå i de siste månedene før giganten Amazon endelig kommer til Norden. Vårt verdenshjørne gjenstår som et av de siste markedene uten en eller flere "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"kjempeplattformer"}]},{"type":"text","value":" for netthandel, og det er der Amazon ser muligheten."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"En \"kjempeplattform\" er ikke bare et vagt buzzord. Jeg mener en "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"aggregator"}]},{"type":"text","value":" i "},{"type":"element","tag":"a","props":{"href":"https://stratechery.com/aggregation-theory/","rel":["nofollow"]},"children":[{"type":"text","value":"Ben Thompson's definisjon"}]},{"type":"text","value":". Kort sagt er det et fenomen som oppstår når nettverkseffekter fører til en positiv feedback-loop som stadig forsterker den dominerende spilleren i markedet. Jeg beverer ordet plattform fordi plattformsfunksjonaliteten er en viktig distinksjon mellom Amazon og alle nettbutikker vi har i Norge idag."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Amazon lar andre butikker selge sine varer på amazon.com. For andre butikker er det attraktivt fordi Amazon kan ta seg av betaling, frakt, lager, kundeservice og mer. Men aller viktigst er det at de fleste kundene er på Amazon allerede. Det at flere selgere velger Amazon fordi kunder er der gjør at Amazon's priser og utvalg blir enda bedre. Det fører igjen til at flere kunder velger Amazon. En positiv feedback-loop."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Av lignende grunner har f eks FINN.no blitt dominerende på boligannonser i Norge. Ingen boligselgere vil risikere å ikke ha en annonse på Finn. Det gjør at boligkjøpere kun sjekker annonsene på Finn, fordi de vet at alle annonsene er der. For en konkurrent å bryte den posisjonen Finn har der er utrolig vanskelig."}]},{"type":"element","tag":"h2","props":{"id":"alternativer-i-norden"},"children":[{"type":"text","value":"Alternativer i Norden"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I Norge ville både Elkjøp, Komplett og Finn lage egne plattformer for netthandel med samme modell som Amazon. Det var en stusselig og lite gjennomtenkt satsning fra alle sammen, fordi de ga opp og la ned "},{"type":"element","tag":"a","props":{"href":"https://blog.vikfand.com/posts/kolonial-norges-amazon/","rel":["nofollow"]},"children":[{"type":"text","value":"kort tid etter"}]},{"type":"text","value":"."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"http://cdon.com","rel":["nofollow"]},"children":[{"type":"text","value":"CDON.com"}]},{"type":"text","value":" er så vidt jeg vet eneste Nordiske selskap med noe som potensielt kan måle seg med det Amazon vil komme med. CDON.com er ikke lenger bare din platebutikk på nettet. Andre butikker som maxgaming.com, computersalg.com, adlibris.no, og mange fler selger sine varer gjennom CDON.com sin løsning. Dette er nesten usynlig for brukeren, men det fører til at CDON har det desidert beste utvalget av varer på nett i Norden med flere millioner artikler."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Skjermdump fra CDON.com sin side som promoterer deres markedsplass.","src":"/posts/e-handel-i-norden-for-amazon/cdon-com-marketplace.png","style":{"aspectRatio":"1045/772"}},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Hvis den tidligere plategiganten kan fortsette å pushe på som plattform ved å få enda flere partnere, enda bedre betalingsløsninger, og enda bedre kundeservice, kan de muligens bygge en såpass sterk barriere at de kan bli en likeverdig konkurrent for Amazon."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Men antakeligvis vil de ikke klare å slå Amazon på det å være en plattform for netthandel. Ikke minst fordi de har hatt flere år på seg til å komme med markedsføring og kundeklubber som Amazon Prime til å faktisk sementere posisjonen sin, men ikke gjort det i betydelig grad."}]},{"type":"element","tag":"h2","props":{"id":"hva-vil-amazonno-se-ut-som"},"children":[{"type":"text","value":"Hva vil Amazon.no se ut som?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Det blir spennende å se hvordan Amazon lanseres i Norden. De vil med sin svært effektive drift og lange erfaring antakeligvis kunne gi de beste prisene på nesten alle merkevarer. Jeg regner med at de vil lansere med flere store partnere på laget slik at de også selger varer i flere nisjer. Bare det vil gjøre Amazon til det mest naturlige stedet for en kunde å gå til for å handle noe på nettet."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Det mer usikre er om de vil lansere tjenester som Prime. Med medlemskap i Prime betaler man en liten sum i måneden mot at man får man gratis frakt på alt man bestiller. I USA får man også raskere leveringstid. Med en slik tjeneste og enormt utvalg vil kunder ha liten grunn til å engang sjekke andre butikker når de skal kjøpe noe."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"img","props":{"alt":"Skjermdump fra Amazon sin nettside som promoterer Amazon Prime. Gratis levering og 150 millioner medlemmer promoteres.","src":"/posts/e-handel-i-norden-for-amazon/amazon-prime-banner.png","style":{"aspectRatio":"1013/531"}},"children":[]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Amazon har i andre markeder brukt både egne løsninger og eksisterende tjenester for frakt av varene. F eks i USA begynte de å kun bruke posten til å levere for å så bygge et eget nettverk med egne biler og til og med fraktfly for å kunne levere raskere og billigere enn konkurrenter kunne drømme om. På dette området har CDON.com ingenting å konkurrere med. I Norge kan muligens Kolonial.no kunne måle seg med tilsvarende raskt frakttilbud. Kolonial har begynt å lage et nettbutikk i "},{"type":"element","tag":"a","props":{"href":"https://blog.vikfand.com/posts/kolonial-norges-amazon/","rel":["nofollow"]},"children":[{"type":"text","value":"motsatt ende som Amazon"}]},{"type":"text","value":". De har nå en knallgod logistikktjeneste i Oslo og Omegn, men om de kan begynne å selge varer med høyere margin enn dagligvarer gjenstår å se."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"alternativer-i-norden","depth":2,"text":"Alternativer i Norden"},{"id":"hva-vil-amazonno-se-ut-som","depth":2,"text":"Hva vil Amazon.no se ut som?"}]}},"_type":"markdown","_id":"content:posts:e-handel-i-norden-for-amazon:index.md","_source":"content","_file":"posts/e-handel-i-norden-for-amazon/index.md","_extension":"md","sitemap":{"loc":"/posts/e-handel-i-norden-for-amazon","images":[]}}