{"_path":"/posts/qe-og-aksjepriser","_dir":"posts","_draft":false,"_partial":false,"_locale":"","title":"Kvantitativ lettelse og aksjepriser","description":"Kvantitativ lettelse (QE) er når sentralbanken kjøper finansielle eierdeler som gjeld og obligasjoner. Det fører til økning av penger i markedene. Mer penger med samme antall varer betyr høyere priser.","date":"2020-03-29T04:45:49.000Z","tags":["aksjer","qe","marked","økonomi","korona","finanskrise"],"lang":"norwegian","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Kvantitativ lettelse eller \"quantitive easing (QE)\" er et uttrykk vi har hørt mye om siden finanskrisen i 2008."}]},{"type":"element","tag":"h2","props":{"id":"kvantittitatativ-hvaforno"},"children":[{"type":"text","value":"Kvantittitatativ hvaforno?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"La oss begynne med at kvantitativ lettelse er et dårlig uttrykk som ikke i det hele tatt er beskrivende for hva det faktisk er. Hvis sentralbanken kjøper finansielle eierandel som aksjer, derivater, obligasjoner, osv. så kaller vi det kvantitativ lettelse."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sentralbanken har historisk sett i all hovedsak kun eid statsobligasjoner, og har hatt som rolle å indirekte styre økonomien ved å låne ut penger til banker til en styringsrentenivå den selv bestemmer. Styringsrenta er roten til prisen av penger, og bestemmer omtrent hva renta på lån bedrifter og privatpersoner er.\nI krisetid tar sentralbanken en litt annen form og blir siste utveis utlåner (lender of last resort), og låner ut penger til banker når ingen andre tær å låne til hverandre.\nDette er et mektig verktøy som må brukes med stor omhu. Sentralbanken har potensielt uendelig med penger og når den trykker penger påvirker det hva penger er verdt. Trykker den for mye, så kan økonomien kollapse og en humanitær krise inntre som følge av hyperinflasjon."}]},{"type":"element","tag":"h2","props":{"id":"hvordan-vi-begynte"},"children":[{"type":"text","value":"Hvordan vi begynte"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finanskrisen i 2008 kom som følge av at en boligboble i USA sprakk i 2007. I utgangspunktet kan en boligboble sprekke uten at den stopper verden fra å gå sin gang, men banker og finansselskap hadde tatt og gitt store lån og avtaler med antakelsen av at boligboblen aldri ville sprekke."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Bankene ble tatt med buksene nede da man fant ut at de eide haugevis av boliglån som plutselig ingen ville kjøpe lenger. Disse boliglånene ville antakeligvis aldri bli betalt tilbake. Ingen ville kjøpe dem, og de sank så mye i pris at ingen visste hva prisen var."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Fordi bankene hadde brukt disse lånene som plutselig ble verdiløse som garanti i andre lån, hadde sprekkingen av boligboblen ringvirkninger i hele verdensøkonomien. Ingen ville gi ut lån lenger, som førte til at ingen kunne investere, som førte til at mange mista jobben og dårlig økonomi."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Sentralbankene kom flyvende inn med kappe for å redde økonomien. Renta var allerede så lav at den vanlige medisinen av å senke rentenivået ikke var effektiv lenger, da det kunne føre til høy inflasjon. Istedet ville de redde bankene ved å kjøpe de verdiløse boliglånene til en såpass høy pris at bankene kunne fortsette å operere som vanlig. Bankene hadde tatt ansvarsløse beslutninger, satt økonomien på spill, men slapp å høste det de sådde. De kom seg stort sett godt unna og tok godt betalt for det.\nMange mener at sentralbankens beslutning i å kjøpe de verdiløse lånene kanskje reddet verden fra en mer betydelig økonomisk kollaps. Det er godt mulig. I desperate sitasjoner kan man bruke ekstreme virkemidler, akkurat som kirurger kan bruke morfin i operasjoner uten narkose."}]},{"type":"element","tag":"h2","props":{"id":"og-vi-fortsetter-med-uendelig-qe"},"children":[{"type":"text","value":"Og vi fortsetter med uendelig QE"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Eksreme tiltak blir et problem i lengden hvis pasienten blir avhengig av det. Det er ikke sunt å være avhengig av morfin jevnlig for å overleve."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Vår pasient er økonomien og den er avhengig av kvantitativ lettelse. Det som skulle være et krisetiltak har nå blitt dagsorden for sentralbanker i USA og Europa. Svevende drømmer om en 100% effektiv økonomi, et aksjemarked som aldri synker, matematiske modeller som spår fremtiden, er hva økonomer med makt tror på. Dette systemet har vært på brinken av kollaps en stund, men når renta er på rundt 0% og sentralbanken kjøper papirer ingen andre vil kjøpe, så kan det fortsette frem til vi merker konsekvensene på andre måter."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Er det krise om økonomien ikke vokser så fort eller til og med krymper en stund? Nei, det bør i alle fall ikke være det. Men på grunn av store mengder gjeld og en religiøs overbevisning av økonomer med makt at økonomien "},{"type":"element","tag":"em","props":{},"children":[{"type":"text","value":"må"}]},{"type":"text","value":" vokse jevnt og trutt, så gjør de alt for å få tallene til å vise det de vil. Jo mer de pusher økonomien på denne måten, jo verre blir det når vi til slutt må møte virkeligheten, og at kontinuerlig økonomisk vekst ikke er mulig."}]},{"type":"element","tag":"h2","props":{"id":"kvantitativ-lettelse-og-priser-på-aksjer-og-andre-instrumenter"},"children":[{"type":"text","value":"Kvantitativ lettelse og priser på aksjer og andre instrumenter"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QE er at sentralbanken kjøper finansielle papirer. De begynte med å kjøpe verdiløse lån for å redde økonimien fra krise, men har fortsatt med å kjøpe mye sikrere instrumenter som obligasjoner. Dette fører til at utbytte i obligasjoner blir mindre, som igjen fører til at andre investorer som privatpersoner og fond ser etter andre instrumenter med mer utbytte."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I hovedsak er disse andre instrumentene aksjer, hvis prisøkning er mye større enn BNP, men vi har også sett kraftig økning i prisene på eiendom og noen råvarer samt kryptovaluta siden sentralbankene begynte å booste økonomien med QE."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"QE resulterer i mer penger i finansmarkedene. Mer penger med samme mengde varer betyr økning i pris. Som konsekvens har alle som allerede eide aksjer og andre finansielle eierdeler økt sin formue betraktelig siden finanskrisen, men for alle andre er det vanskeligere å komme inn på markedet. Dette er enda en trend, i tillegg til globalisering og automasjon, som fører til mer økonomisk ulikhet i vår del av verden. Heldigvis har Norge egen valuta og et utenlands pensjonsfond som lar oss ta del i bonanzaen."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"kvantittitatativ-hvaforno","depth":2,"text":"Kvantittitatativ hvaforno?"},{"id":"hvordan-vi-begynte","depth":2,"text":"Hvordan vi begynte"},{"id":"og-vi-fortsetter-med-uendelig-qe","depth":2,"text":"Og vi fortsetter med uendelig QE"},{"id":"kvantitativ-lettelse-og-priser-på-aksjer-og-andre-instrumenter","depth":2,"text":"Kvantitativ lettelse og priser på aksjer og andre instrumenter"}]}},"_type":"markdown","_id":"content:posts:qe-og-aksjepriser:index.md","_source":"content","_file":"posts/qe-og-aksjepriser/index.md","_extension":"md","sitemap":{"loc":"/posts/qe-og-aksjepriser","images":[]}}